common-lisp/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>notes</title>
<!-- 2017-12-08 Fri 00:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. While reading: "Lisp Outside the Box" by Nick Levine</a></li>
<li><a href="#sec-2">2. Memory</a>
<ul>
<li><a href="#sec-2-1">2.1. Which questions we want to answer:</a></li>
<li><a href="#sec-2-2">2.2. Garbage Collector</a></li>
<li><a href="#sec-2-3">2.3. When does allocation <i>almost</i> always occur in Lisp? And what is the exception?</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. What's the case for SBCL?</a></li>
<li><a href="#sec-2-3-2">2.3.2. (SBCL) Why tagged pointers?</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. What does <i>consing</i> mean?</a></li>
<li><a href="#sec-2-5">2.5. How long are memeory references valid?</a></li>
<li><a href="#sec-2-6">2.6. How to recycle memory?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> While reading: "Lisp Outside the Box" by Nick Levine</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.nicklevine.org/lisp-book/">https://www.nicklevine.org/lisp-book/</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Memory</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Which questions we want to answer:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>how to request to allocate memory?
</li>
<li>how long are memory references valid?
</li>
<li>how to recycle memory when you done with it?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Garbage Collector</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Every Lisp implementation has a GC, no exception
</li>
<li>The author calls the garbace collector, GC, a build-in library
</li>
<li>Pretty much everything said about the Common Lisp GC, in this chapter of the book,
applies to all the Lisp GCs, and is also relevant to other language GCs as well
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> When does allocation <i>almost</i> always occur in Lisp? And what is the exception?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Whenever something new gets created, that is not <b><code>#'EQ</code></b> to anything that is
there already!
</p>

<div class="org-src-container">

<pre class="src src-lisp">(cons 1 2)
(make-instance 'animal)
(1+ most-positive-fixnum) <span style="color: #99968b;">;; </span><span style="color: #99968b;">why? see below</span>
(read-line)
</pre>
</div>

<p>
<b>The <i>notable</i> Exception:</b>
</p>
<ul class="org-ul">
<li><i>in most implementations</i> <span class="underline">allocation doesn't occur when</span> performing any arithmetic
involving <b>fixnums</b>, those are integers betwee <b><code>most-negative-fixnum</code></b> and
<b><code>most-positive-fixnum</code></b>, and so long the final result are all within this range,
you won't have allocated
</li>
</ul>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> What's the case for SBCL?</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Before consulting the SBCL Documentation the constants are:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">tested on a 64bit machine, with 64bit SBCL version "1.4.1"</span>
(= most-positive-fixnum 4611686018427387903 (1- (expt 2 62))) <span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; T</span>
(= most-negative-fixnum -4611686018427387904 (- (expt 2 62))) <span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; T</span>
</pre>
</div>

<p>
So the range spans 2<sup>63</sup> values! (2<sup>63</sup>-1 + 1, because we count 0), the question then is
if we have 64bit registers:
</p>

<p>
<b>Why is it 63bits rather than 64!?</b>
</p>
<ul class="org-ul">
<li>According to the implementation, atleast one bit, as in this case, is reserved for
the <b>n-fixnum-tag-bits</b>, which is used <span class="underline">to determine</span> whether it is a <span class="underline">fixnum or</span>
<span class="underline">not</span>!
</li>
</ul>

<p>
<b>Then, why do we take a bit, to test if something is a fixnum?</b>
</p>
<ul class="org-ul">
<li>Ok, so this is really cool. In 64bit SBCL, every lisp object has type information, this
information at least for some instances, <span class="underline">is already part of the pointer to them</span>.

<p>
For a fixnum a pointer ending (the least significant bit) with a '0' bit reads the
other 63bits and interprets them as an immediate fixnum value!!!
</p>

<p>
If the least significant bit is not a '0' <span class="underline">then</span> the first 4 bits are interpreted
as the type! And the rest of the pointer bits are the address to a dword in the lisp
heap!
</p>
</li>
</ul>

<p>
<b>Why can we take 4bits of the address and use them for type information</b>?
</p>
<ul class="org-ul">
<li>Like aren't we sacrificing a lot of addresses this way? This is fixed by having
data be double word alligned in memory. In sbcl a double word is 2x64=128bits or
16 bytes. So the address points to those dword aligned 'pages' and, not to 
the individual 16 bytes within, so the least significant 4bits (that now can't
point to the bytes) are used to store the type information for this dword lisp-data!

<p>
This concept is known as <b>Tagged pointers</b> !!!
</p>
</li>
</ul>

<p>
<b>A cool example of the immediate pointer=fixnum concept</b>
</p>
<ul class="org-ul">
<li><b>TODO</b> I think it is worth trying to understand the assembly of this microexample!
</li>
</ul>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">Fixnums are immediately stored in the pointer information</span>

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">foo</span> (x)
  (+ x 7))

(disassemble 'foo)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; ; disassembly for FOO:</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(...)</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">The immediate value 14 is in binary #b1110, because 7 is in binary #b111, the 0 is</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">the fixnum immediate pointer tag information!!</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">TODO: I think it is worth trying to understand the assembly of this microexample!</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">39:       BF0E000000       MOV EDI, 14                      ; no-arg-parsing entry point</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">3E:       488BD1           MOV RDX, RCX</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">41:       41BBF004B021     MOV R11D, #x21B004F0             ; GENERIC-+</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">47:       41FFD3           CALL R11</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">4A:       488BE5           MOV RSP, RBP</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">4D:       F8               CLC</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">4E:       5D               POP RBP</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">4F:       C3               RET</span>
</pre>
</div>

<p>
<b>Another Tagged Pointer Example</b>
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setf *x* (1+ most-positive-fixnum)
      *y* (1+ most-positive-fixnum))

(eq *x* *y*) <span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; NIL</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">But, use a value that is within the fixnum range:</span>
(setf *x* 20
      *y* 20)

(eq *x* *y*) <span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; T</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">Becaseu EQ compares pointers, and fixnums are immediately encoded</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">in the pointer, so in effect "there is no pointer" !</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">the function (sb-kernel:get-lisp-obj-address 123) returns the object a</span>

(sb-kernel:get-lisp-obj-address 123) <span style="color: #99968b;">;; </span><span style="color: #99968b;">==&gt; 246  ...?</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">because the binary representation of 123 is:</span>
(format nil <span style="color: #95e454;">"~b"</span> 123) ==&gt; <span style="color: #95e454;">"1111011"</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">an thus adding the lowtag '0':"1111011" + '0' =&gt; 11110110</span>
#b11110110 ==&gt; 246 <span style="color: #99968b;">;; </span><span style="color: #99968b;">!!!</span>
</pre>
</div>

<p>
Since this is a rather interesting topic lets detour a little bit further into it along
the SBCL path.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> (SBCL) Why tagged pointers?</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
First of all because Common Lisp is dynamically typed, the language implementation
must distinguish between different types (dynamically = at runtime). A solution to
this is boxing.
</p>

<p>
<b>What is Boxing?</b>
</p>
<ul class="org-ul">
<li>Boxing means grouping a value with an overhead with type and optionally size
information, and referring to it through a pointer.
</li>
</ul>

<p>
<b>What is unboxing then?</b>
</p>
<ul class="org-ul">
<li>The inverse of the above insofar as we get the value that is boxed directly.  Those
values usually the primitive machine types (int, float, byte), in other language
also referred to as: primitive types (java), value types (NET, as opposed to
reference types) or just "unboxed" (in haskell)
</li>
</ul>

<p>
<b>What are the disadvantages of Boxing?</b>
</p>
<ol class="org-ol">
<li>adds overhead to the values
</li>
<li>Must be allocated
</li>
<li>so it uses up heap space
</li>
<li>and thus is garbage collected (or destroyed/freed), if necessary
</li>
<li>To access the value, two lookups are needed: (1) getting the pointer address, (2)
using the pointer address to look up the datum on the lisp heap
</li>
</ol>

<p>
<b>Can we do it without the disadvantags?</b>
</p>
<ul class="org-ul">
<li>Having the cake and eating it too can indeed work, by using the immediate tagged
pointer representation. Just like fixnums in SBCL are represented by a 64bit word,
where the least significant bit is 0 and the folloing 63bit represent the fixnum.
So they're not even pointers (!) but immediate values.
</li>

<li><b>This way:</b> 
<ul class="org-ul">
<li>the first '0' bit is all the overhead we need, no allocation, heap space wasted,
gc need, and a single lookup of the pointer itself is all we need to get at the
value.
</li>
</ul>
</li>

<li><b>The trade of is:</b> 
<ul class="org-ul">
<li>the value must fit into a 64bit word and needs to relinquish some of its bits for
the tag (called lowtag in sbcl). These lowtag bits implicate what kind of
immediate type representation is used (characters are also immediate in sbcl), and
can still use boxing when necessary by having some of the lowtag bits indicate
that the pointer truly is to be used to lookup the actual boxed value on the heap.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> What does <i>consing</i> mean?</h3>
<div class="outline-text-3" id="text-2-4">
<p>
In Lisp consing refers to allocation of memory in general. It does therefore not just
mean the use of <b><code>CONS</code></b> or cons cells.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> How long are memeory references valid?</h3>
<div class="outline-text-3" id="text-2-5">
<p>
For as long as your code can access it by any means whatsoever. Only once this is not
the case, the memory becomes <i>potential garbage</i>, and will be freed by the GC somewhere
in the future.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> How to recycle memory?</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Once the GC freed up some space because of the reasons stated under "How long are
memory references valid", the memory automatically be reclaimed.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-12-08 Fri 00:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
